# 11. 画出下列代码内存图
import copy

list01 = [
    ["烤鸭", "豆汁"],
    ["火锅", "兔头"],
    ["麻花", "包子"],
]
list02 = list01
list03 = list01[:] # 复制浅层数据
list04 = copy.deepcopy(list01)

# 修改列表第一个元素(指向新列表)
list04[0] = ["全聚德", "大董"]
# print(list04)
# print(list01)

# 修改列表第一个元素的第二个元素(指向新列表)
list03[0][1] = ["全聚德", "大董"]
# [['烤鸭', ['全聚德', '大董']], ['火锅', '兔头'], ['麻花', '包子']]
print(list03)
print(list01)

# 修改列表第一个元素指向的列表元素("全聚德"   "大董" )
list02[0][:] = ["全聚德", "大董"]
# [['全聚德', '大董'], ['火锅', '兔头'], ['麻花', '包子']]
print(list02)
print(list01)


# 简易版本
list_new = ["a","b","c"]
# 通过索引修改(将列表地址给第一个元素)
list_new[0] = [100,200]
# 通过切片修改(遍历右侧可迭代数据,依次赋值给左侧定位的区域)
list_new[-2:] = [300,400]

print(list_new)# [ [100,200] ,  300,  400   ]